Tekla Open API Reference for Tekla Structures 2025
ShapeItemEnumerator Methods
The ShapeItemEnumerator type exposes the following members.
Methods
Name | Description
GetSize
 Returns the total amount of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
See Also
Reference
ShapeItemEnumerator Class
Tekla.Structures.Catalogs Namespace